app/Http/Controllers/Admin/AdminController.php

    public function login(Request $request)
    {
        $user = User::where('user_name', $request->user_name)->where('status', 0)->first();
---
select * from `users` where `user_name` = 'admin' and `status` = 0 and `users`.`deleted_at` is null limit 1

    public function dashboard()
    {

        if (request()->ajax()) {
            $start = new DateTime('first day of -1 year');
            $end = new DateTime('first day of next month');
            $interval = new DateInterval('P1M');
            $period = new DatePeriod($start, $interval, $end);

            $months = [];
            $month_sales = [];
            $month_collections = [];
            foreach ($period as $dt) {
                $start_date = $dt->format("Y-m-01");
                $end_date = $dt->format("Y-m-t");

                $sales = DB::table('view_sales')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->sum('amount');
                $salesReturn = DB::table('view_sales_returns')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->sum('amount');
                $totalSales = $sales - $salesReturn;
                $collections = DB::table('view_collection_history')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->where('collection_type', '!=', 'adjust')->sum('amount');
---
select sum(`amount`) as aggregate from `view_sales` where `date` >= '2025-07-01' and `date` <= '2025-07-31'
select sum(`amount`) as aggregate from `view_sales_returns` where `date` >= '2025-07-01' and `date` <= '2025-07-31'
select sum(`amount`) as aggregate from `view_collection_history` where `date` >= '2025-07-01' and `date` <= '2025-07-31' and `collection_type` != 'adjust'

                $start_date = date('Y-m-d', strtotime('20-12-2023'));
                $end_date = $dt->format("Y-m-d");

                $sales = DB::table('view_sales')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->sum('amount');
                $salesReturn = DB::table('view_sales_returns')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->sum('amount');
                $totalSales = $sales - $salesReturn;
                $collections = DB::table('view_collection_history')->where('date', '>=', $start_date)->where('date', '<=', $end_date)->where('collection_type', '!=', 'adjust')->sum('amount');
---
select sum(`amount`) as aggregate from `view_sales` where `date` >= '2023-12-20' and `date` <= '2026-05-01'
select sum(`amount`) as aggregate from `view_sales_returns` where `date` >= '2023-12-20' and `date` <= '2026-05-01'
select sum(`amount`) as aggregate from `view_collection_history` where `date` >= '2023-12-20' and `date` <= '2026-05-01' and `collection_type` != 'adjust'

            return response()->json(['status' => 'success', 'monthlyData' => $monthlyData, 'weeklyData' => $weeklyData]);
        }

        $sales = DB::table('view_sales')->sum('amount');
        $salesReturn = DB::table('view_sales_returns')->sum('amount');
        $totalSales = $sales - $salesReturn;
        $collections = DB::table('view_collection_history')->where('collection_type', '!=', 'adjust')->sum('amount');
        $outstanding = $totalSales - $collections;
        $total_clients = Client::where('status', 1)->count();
        $lifting = DB::table('view_liftings')->sum('amount');
        $liftingReturn = DB::table('view_lifting_returns')->sum('amount');
        $payment = DB::table('view_payments')->whereNotIn('type', ['adjust', 'return'])->sum('amount');
---
select sum(`amount`) as aggregate from `view_sales`
select sum(`amount`) as aggregate from `view_sales_returns`
select sum(`amount`) as aggregate from `view_collection_history` where `collection_type` != 'adjust'
select count(*) as aggregate from `clients` where `status` = 1 and `clients`.`deleted_at` is null
select sum(`amount`) as aggregate from `view_liftings`
select sum(`amount`) as aggregate from `view_lifting_returns`
select sum(`amount`) as aggregate from `view_payments` where `type` not in ('adjust', 'return')

        $stock_value = 0;

        // Get all product_ids involved in lifting
        $product_ids = DB::table('view_liftings')
            ->select('product_id')
            ->distinct()
            ->pluck('product_id');

        // Preload sums grouped by product_id
        $liftings = DB::table('view_liftings')
            ->select('product_id', DB::raw('SUM(qty) as qty'), DB::raw('SUM(amount) as amount'))
            ->groupBy('product_id')
            ->get()
            ->keyBy('product_id');

        $lifting_returns = DB::table('view_lifting_returns')
            ->select('product_id', DB::raw('SUM(qty) as qty'))
            ->groupBy('product_id')
            ->get()
            ->pluck('qty', 'product_id');

        $sales = DB::table('view_sales')
            ->select('product_id', DB::raw('SUM(qty) as qty'))
            ->groupBy('product_id')
            ->get()
            ->pluck('qty', 'product_id');

        $sales_returns = DB::table('view_sales_returns')
            ->select('product_id', DB::raw('SUM(qty) as qty'))
            ->groupBy('product_id')
            ->get()
            ->pluck('qty', 'product_id');

        $retail_sales = DB::table('view_retail_sales')
            ->select('product_id', DB::raw('SUM(qty) as qty'))
            ->groupBy('product_id')
            ->get()
            ->pluck('qty', 'product_id');

        $online_sales = DB::table('view_online_sales')
            ->whereNotNull('store_id')
            ->select('product_id', DB::raw('SUM(qty) as qty'))
            ->groupBy('product_id')
            ->get()
            ->pluck('qty', 'product_id');
---
select distinct `product_id` from `view_liftings`
select `product_id`, SUM(qty) as qty, SUM(amount) as amount from `view_liftings` group by `product_id`
select `product_id`, SUM(qty) as qty from `view_lifting_returns` group by `product_id`
select `product_id`, SUM(qty) as qty from `view_sales` group by `product_id`
select `product_id`, SUM(qty) as qty from `view_sales_returns` group by `product_id`
select `product_id`, SUM(qty) as qty from `view_retail_sales` group by `product_id`
select `product_id`, SUM(qty) as qty from `view_online_sales` where `store_id` is not null group by `product_id`

        }


        $today_retail_sales = RetailSale::where('date', date('Y-m-d'))->get();
        $total_products = Product::where('status', true)->count();
---
select * from `retail_sales` where `date` = '2026-07-18' and `retail_sales`.`deleted_at` is null
select count(*) as aggregate from `products` where `status` = 1 and `products`.`deleted_at` is null

        ];

        $RegionSales = [];
        $regions = Region::where('status', 1)->orderBy('name', 'asc')->get();
        foreach ($regions as $region) {
            $sales = DB::table('view_sales')->where('region_id', $region->id)->sum('amount');
            $salesReturn = DB::table('view_sales_returns')->where('region_id', $region->id)->sum('amount');
---
select * from `regions` where `status` = 1 and `regions`.`deleted_at` is null order by `name` asc
select sum(`amount`) as aggregate from `view_sales` where `region_id` = 13
select sum(`amount`) as aggregate from `view_sales_returns` where `region_id` = 13