app/Http/Controllers/Admin/SalesController.php

    public function getOrderNo()
    {
        $first = date('Y-m-01');
        $last = new Carbon('last day of this month');
        $order = Sales::withoutGlobalScope(CompanyScope::class)->withTrashed()->select(['invoice'])->whereDate('created_at', '>=', $first)->whereDate('created_at', '<=', $last)->orderBy('id', 'desc')->first();
---
select `invoice` from `sales` where date(`created_at`) >= '2026-07-01' and date(`created_at`) <= '2026-07-31' order by `id` desc limit 1


        $title = 'Add New Sales';
        $invoice = $this->getOrderNo();
        $stores = Store::where('status', 1)->get();
        $staffs = Staff::where('status', 1)->where('type', 'sales')->orderBy('name', 'asc')->get();
        $clients = Client::where('status', 1)->orderBy('name', 'asc')->get();
        $products = Product::where('product_type', 'Consumer')->where('status', 1)->orderBy('name', 'asc')->get();
        $cash_heads = CoaSetup::with('parent')->whereHas('parent', function ($query) {
            $query->where('head_name', 'Cash In Hand')->orWhere('head_name', 'Cash In Bank');
        })->get();
---
select * from `stores` where `status` = 1 and `stores`.`deleted_at` is null
select * from `staff` where `status` = 1 and `type` = 'sales' and `staff`.`deleted_at` is null order by `name` asc
select * from `clients` where `status` = 1 and `clients`.`deleted_at` is null order by `name` asc
select * from `products` where `product_type` = 'Consumer' and `status` = 1 and `products`.`deleted_at` is null order by `name` asc
select * from `coa_setups` where `coa_setups`.`id` in (23) and `coa_setups`.`deleted_at` is null