app/Http/Controllers/Admin/StaffController.php

select * from `branches` where `company_id` = '1' and `branches`.`deleted_at` is null order by `name` asc
select * from `companies` where `companies`.`deleted_at` is null order by `name` asc
select * from `branches` where `company_id` is null and `branches`.`deleted_at` is null order by `name` asc
---
    public function create()
    {
        if (request()->ajax()) {
            $branches = Branch::where('company_id', request('company_id'))->orderBy('name')->get();
            return response()->json(['status' => 'success', 'branches' => $branches]);
        }

        $title = 'Add New Staff';
        $companies = Company::orderBy('name')->get();
        $branches = Branch::where('company_id', Auth::user()->company_id)->orderBy('name')->get();